
# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # RGB
#  - [-1, 1, PConv, [64, 3, 5, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] #2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8

# AMG
  - [ -2, 1, Conv, [ 64,3,2 ] ] #4
  - [ -1, 1, Conv, [ 128,3,2 ] ] #5
  - [ -1, 1, Conv, [ 256,3,2 ] ] #6
  - [ -1, 1, SpatialAttention, [ 3 ] ] #7
  - [ 6, 1, Conv, [ 512,3,2 ] ] #8
  - [ -1, 1, SpatialAttention, [ 3 ] ] #9
  - [ 8, 1, Conv, [ 1024,3,2 ] ] #10
  - [ -1, 1, SpatialAttention, [ 3 ] ] #11
#  - [2, 1, Conv, [256, 3, 2]] # 11

  # IR
#  - [-2, 1, AMG, [1]] # 4
  - [-4, 1, Conv, [64, 3, 2]] # 12
  - [-1, 1, Conv, [128, 3, 2]] # 13
  - [-1, 3, C2f, [128, True]] # 14
  - [-1, 1, Conv, [256, 3, 2]] # 15

  # Fusion1 使用时记得修改文件block文件将RIFusion置为空
  - [-3,1,RIFusion,[64]] #16

  # RGB
  - [-4, 6, C2f, [256, True]] #17
  - [-1, 1, Conv, [512, 3, 2]] # 18

  # IR
  - [-4, 6, C2f, [256, True]] # 19
  - [-1, 1, Conv, [512, 3, 2]] # 20

  # Fusion2
  - [-3,1,RIFusion,[128]]  #21

  # RGB
  - [-4, 6, C2f, [512, True]] #22
  - [-1, 1, Conv, [1024, 3, 2]] # 23

  # IR
  - [-4, 6, C2f, [512, True]] #24
  - [-1, 1, Conv, [1024, 3, 2]] # 25

  # Fusion3
  - [-3,1,RIFusion,[256]] #26

  # RGB
  - [-4, 3, C2f, [1024, True]] #27
  - [-1, 1, SPPF, [1024, 5]] # 28

  # IR
  - [-4, 3, C2f, [1024, True]] #29
  - [-1, 1, SPPF, [1024, 5]] # 30
  - [[3,7],1,SAM,[1]] #31
  - [[18,9],1,SAM,[1]] #32
  - [[23,11],1,SAM,[1]] #33


  - [[31,15,17,19], 1, GPT, [64]] # 34
  - [[32,20,22,24], 1, GPT, [128]] # 35
  - [[33,25,28,30],1, GPT, [256]] # 36

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]# 37
  - [[-1, 35], 1, Concat, [1]] # 38
  - [-1, 3, C2f, [512]] # 39

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #40
  - [[-1, 34], 1, Concat, [1]] # 41
  - [-1,1,nn.Upsample,[None,8,"nearest"]]#42

  - [41, 3, C2f, [256]] # 43

  - [-1, 1, Conv, [256, 3, 2]] #44
  - [[-1, 39], 1, Concat, [1]] # 45
  - [-1, 3, C2f, [512]] # 46

  - [-1, 1, Conv, [512, 3, 2]] # 47
  - [[-1, 36], 1, Concat, [1]] # 48
  - [-1, 3, C2f, [1024]] # 49

  - [[43, 46, 49, 42, 7, 9, 11], 1, Detect, [nc]] # 50